# DBShowObjConnDlg

## Description
Show the object connection dialog for the selected objects.

```pascal
FUNCTION DBShowObjConnDlg : BOOLEAN;
```

```python
def vs.DBShowObjConnDlg():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2011

## Category
* ODBC